# SkyBackgroundSettings Properties

---
The SkyBackgroundSettings type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from BackgroundSettings)
Top
#### Reference
SkyBackgroundSettings Class
Autodesk.Revit.DB Namespace